# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Create a "fruit" dataframe that reflects the above example **using a list** data structure

[This resource could help you](https://www.geeksforgeeks.org/create-a-pandas-dataframe-from-lists/), or [this resource](https://datatofish.com/list-to-dataframe/).

In [ ]:
import pandas as pd

lst = [['30', '21']]

df = pd.DataFrame(lst, columns = ['Apples', 'Bananas'])
df

  Apples Bananas
0     30      21

# Mission 2

Create a "fruit_vendors" dataframe that reflects the below example **using a dictionary** data structure

![](https://i.imgur.com/CHPn7ZF.png)

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html)

In [ ]:
lst2 = {'2017 Sales': [35, 21], '2018 Sales': [41, 34,]}
lst3 = pd.DataFrame.from_dict(lst2, columns = ['Apples', 'Bananas'], orient='index')
lst3

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

# Mission 3

Use a loop to display the values from each column in the dataframe from mission 2.

In [ ]:
for index, row in lst3.iterrows():
    print (row["Apples"], row["Bananas"])

35 21
41 34

# Mission 4

Delete the first row of the dataframe from mission 2

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [ ]:
lst3 = lst3.drop("2017 Sales", axis = 0)
lst3

            Apples  Bananas
2018 Sales      41       34

# Mission 5

Delete the first column from the dataframe from mission 2.

In [ ]:
lst3 = lst3.drop(columns="Apples")
lst3

            Bananas
2018 Sales       34